espressif/esp-idf/components/soc/esp32c5/include/soc/pcr_struct.h
/** Type of sdio_slave_conf register
 *  SDIO_SLAVE configuration register
 */
typedef union {
    struct {
        /** sdio_slave_clk_en : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable sdio_slave clock
         */
        uint32_t sdio_slave_clk_en:1;
        /** sdio_slave_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 0 to reset sdio_slave module
         */
        uint32_t sdio_slave_rst_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pcr_sdio_slave_conf_reg_t;

/** Type of usb_otg_conf register
 *  USB_OTG configuration register
 */
typedef union {
    struct {
        /** usb_otg_clk_en : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable usb_otg bus clock
         */
        uint32_t usb_otg_clk_en:1;
        /** usb_otg_adp_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 0 to reset usb_otg core adp
         */
        uint32_t usb_otg_adp_rst_en:1;
        /** usb_otg_misc_rst_en : R/W; bitpos: [2]; default: 0;
         *  Set 0 to reset usb_otg misc
         */
        uint32_t usb_otg_misc_rst_en:1;
        /** usb_otg_global_rst_en : R/W; bitpos: [3]; default: 0;
         *  Set 0 to reset usb_otg module
         */
        uint32_t usb_otg_global_rst_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_usb_otg_conf_reg_t;

/** Type of usb_otg_clk_conf register
 *  USB_OTG func clk configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** usb_otg_phy_refclk_sel : R/W; bitpos: [20]; default: 1;
         *  Set 1 to sel 12m pll clock, set 0 to sel pad clock
         */
        uint32_t usb_otg_phy_refclk_sel:1;
        /** usb_otg_phy_refclk_en : R/W; bitpos: [21]; default: 1;
         *  Set 1 to enable usb_otg_phy_refclk clock
         */
        uint32_t usb_otg_phy_refclk_en:1;
        /** usb_otg_adp_clk_sel : R/W; bitpos: [23:22]; default: 0;
         *  Set 0 to sel clock from gpio_matrix, set 1 to sel osc32k, set 2 to sel xtal32k, set
         *  3 to sel ext32k
         */
        uint32_t usb_otg_adp_clk_sel:2;
        /** usb_otg_adp_clk_en : R/W; bitpos: [24]; default: 1;
         *  Set 1 to enable usb_otg_adp_clk clock
         */
        uint32_t usb_otg_adp_clk_en:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} pcr_usb_otg_clk_conf_reg_t;

/** Type of bs_conf register
 *  BS configuration register
 */
typedef union {
    struct {
        /** bs_clk_en : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable bs clock
         */
        uint32_t bs_clk_en:1;
        /** bs_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 0 to reset bs module
         */
        uint32_t bs_rst_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pcr_bs_conf_reg_t;

/** Type of bs_func_conf register
 *  BS_FUNC_CLK configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** bs_tx_rst_en : R/W; bitpos: [23]; default: 0;
         *  Set 0 to reset bs tx module
         */
        uint32_t bs_tx_rst_en:1;
        /** bs_rx_rst_en : R/W; bitpos: [24]; default: 0;
         *  Set 0 to reset bs rx module
         */
        uint32_t bs_rx_rst_en:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} pcr_bs_func_conf_reg_t;

/** Type of timergroup_wdt_conf register
 *  TIMERGROUP_WDT configuration register
 */
typedef union {
    struct {
        /** tg0_wdt_rst_en : R/W; bitpos: [0]; default: 0;
         *  Set 0 to reset timer_group0 wdt module
         */
        uint32_t tg0_wdt_rst_en:1;
        /** tg1_wdt_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 0 to reset timer_group1 wdt module
         */
        uint32_t tg1_wdt_rst_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pcr_timergroup_wdt_conf_reg_t;

/** Type of timergroup_xtal_conf register
 *  TIMERGROUP1 configuration register
 */
typedef union {
    struct {
        /** tg0_xtal_rst_en : R/W; bitpos: [0]; default: 0;
         *  Set 0 to reset timer_group0 xtal clock domain
         */
        uint32_t tg0_xtal_rst_en:1;
        /** tg1_xtal_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 0 to reset timer_group1 xtal clock domain
         */
        uint32_t tg1_xtal_rst_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pcr_timergroup_xtal_conf_reg_t;

/** Type of km_conf register
 *  Key Manager configuration register
 */
typedef union {
    struct {
        /** km_clk_en : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable km clock
         */
        uint32_t km_clk_en:1;
        /** km_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 0 to reset km module
         */
        uint32_t km_rst_en:1;
        /** km_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset km module
         */
        uint32_t km_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_km_conf_reg_t;


/** Group: Frequency Statistics Register */
/** Type of sysclk_freq_query_0 register
 *  SYSCLK frequency query 0 register
 */
typedef union {
    struct {
        /** fosc_freq : HRO; bitpos: [7:0]; default: 8;
         *  This field indicates the frequency(MHz) of FOSC.
         */
        uint32_t fosc_freq:8;
        /** pll_freq : HRO; bitpos: [17:8]; default: 96;
         *  This field indicates the frequency(MHz) of SPLL.
         */
        uint32_t pll_freq:10;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} pcr_sysclk_freq_query_0_reg_t;


/** Group: Version Register */
/** Type of date register
 *  Date register.
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 36720976;
         *  PCR version information.
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} pcr_date_reg_t;


typedef struct pcr_dev_t {
    volatile pcr_uart0_conf_reg_t uart0_conf;
    volatile pcr_uart0_sclk_conf_reg_t uart0_sclk_conf;
    volatile pcr_uart0_pd_ctrl_reg_t uart0_pd_ctrl;
    volatile pcr_uart1_conf_reg_t uart1_conf;
    volatile pcr_uart1_sclk_conf_reg_t uart1_sclk_conf;
    volatile pcr_uart1_pd_ctrl_reg_t uart1_pd_ctrl;
    volatile pcr_mspi_conf_reg_t mspi_conf;
    volatile pcr_mspi_clk_conf_reg_t mspi_clk_conf;
    volatile pcr_i2c_conf_reg_t i2c_conf;
    volatile pcr_i2c_sclk_conf_reg_t i2c_sclk_conf;
    volatile pcr_twai0_conf_reg_t twai0_conf;
    volatile pcr_twai0_func_clk_conf_reg_t twai0_func_clk_conf;
    volatile pcr_twai1_conf_reg_t twai1_conf;
    volatile pcr_twai1_func_clk_conf_reg_t twai1_func_clk_conf;
    volatile pcr_uhci_conf_reg_t uhci_conf;
    volatile pcr_rmt_conf_reg_t rmt_conf;
    volatile pcr_rmt_sclk_conf_reg_t rmt_sclk_conf;
    volatile pcr_ledc_conf_reg_t ledc_conf;
    volatile pcr_ledc_sclk_conf_reg_t ledc_sclk_conf;
    volatile pcr_timergroup0_conf_reg_t timergroup0_conf;
    volatile pcr_timergroup0_timer_clk_conf_reg_t timergroup0_timer_clk_conf;
    volatile pcr_timergroup0_wdt_clk_conf_reg_t timergroup0_wdt_clk_conf;
    volatile pcr_timergroup1_conf_reg_t timergroup1_conf;
    volatile pcr_timergroup1_timer_clk_conf_reg_t timergroup1_timer_clk_conf;
    volatile pcr_timergroup1_wdt_clk_conf_reg_t timergroup1_wdt_clk_conf;
    volatile pcr_systimer_conf_reg_t systimer_conf;
    volatile pcr_systimer_func_clk_conf_reg_t systimer_func_clk_conf;
    volatile pcr_i2s_conf_reg_t i2s_conf;
    volatile pcr_i2s_tx_clkm_conf_reg_t i2s_tx_clkm_conf;
    volatile pcr_i2s_tx_clkm_div_conf_reg_t i2s_tx_clkm_div_conf;
    volatile pcr_i2s_rx_clkm_conf_reg_t i2s_rx_clkm_conf;
    volatile pcr_i2s_rx_clkm_div_conf_reg_t i2s_rx_clkm_div_conf;
    volatile pcr_saradc_conf_reg_t saradc_conf;
    volatile pcr_saradc_clkm_conf_reg_t saradc_clkm_conf;
    volatile pcr_tsens_clk_conf_reg_t tsens_clk_conf;
    volatile pcr_usb_device_conf_reg_t usb_device_conf;
    volatile pcr_intmtx_conf_reg_t intmtx_conf;
    volatile pcr_pcnt_conf_reg_t pcnt_conf;
    volatile pcr_etm_conf_reg_t etm_conf;
    volatile pcr_pwm_conf_reg_t pwm_conf;
    volatile pcr_pwm_clk_conf_reg_t pwm_clk_conf;
    volatile pcr_parl_io_conf_reg_t parl_io_conf;
    volatile pcr_parl_clk_rx_conf_reg_t parl_clk_rx_conf;
    volatile pcr_parl_clk_tx_conf_reg_t parl_clk_tx_conf;
    volatile pcr_pvt_monitor_conf_reg_t pvt_monitor_conf;
    volatile pcr_pvt_monitor_func_clk_conf_reg_t pvt_monitor_func_clk_conf;
    volatile pcr_gdma_conf_reg_t gdma_conf;
    volatile pcr_spi2_conf_reg_t spi2_conf;
    volatile pcr_spi2_clkm_conf_reg_t spi2_clkm_conf;
    volatile pcr_aes_conf_reg_t aes_conf;
    volatile pcr_sha_conf_reg_t sha_conf;
    volatile pcr_rsa_conf_reg_t rsa_conf;
    volatile pcr_rsa_pd_ctrl_reg_t rsa_pd_ctrl;
    volatile pcr_ecc_conf_reg_t ecc_conf;
    volatile pcr_ecc_pd_ctrl_reg_t ecc_pd_ctrl;
    volatile pcr_ds_conf_reg_t ds_conf;
    volatile pcr_hmac_conf_reg_t hmac_conf;
    volatile pcr_ecdsa_conf_reg_t ecdsa_conf;
    volatile pcr_iomux_conf_reg_t iomux_conf;
    volatile pcr_iomux_clk_conf_reg_t iomux_clk_conf;
    volatile pcr_mem_monitor_conf_reg_t mem_monitor_conf;
    volatile pcr_regdma_conf_reg_t regdma_conf;
    volatile pcr_trace_conf_reg_t trace_conf;
    volatile pcr_assist_conf_reg_t assist_conf;
    volatile pcr_cache_conf_reg_t cache_conf;
    volatile pcr_modem_conf_reg_t modem_conf;
    volatile pcr_timeout_conf_reg_t timeout_conf;
    volatile pcr_sysclk_conf_reg_t sysclk_conf;
    volatile pcr_cpu_waiti_conf_reg_t cpu_waiti_conf;
    volatile pcr_cpu_freq_conf_reg_t cpu_freq_conf;
    volatile pcr_ahb_freq_conf_reg_t ahb_freq_conf;
    volatile pcr_apb_freq_conf_reg_t apb_freq_conf;
    volatile pcr_sysclk_freq_query_0_reg_t sysclk_freq_query_0;
    volatile pcr_pll_div_clk_en_reg_t pll_div_clk_en;
    volatile pcr_ctrl_clk_out_en_reg_t ctrl_clk_out_en;
    volatile pcr_ctrl_tick_conf_reg_t ctrl_tick_conf;
    volatile pcr_ctrl_32k_conf_reg_t ctrl_32k_conf;
    volatile pcr_sram_power_conf_0_reg_t sram_power_conf_0;
    volatile pcr_sram_power_conf_1_reg_t sram_power_conf_1;
    volatile pcr_sec_conf_reg_t sec_conf;
    uint32_t reserved_140[2];
    volatile pcr_bus_clk_update_reg_t bus_clk_update;
    volatile pcr_sar_clk_div_reg_t sar_clk_div;
    volatile pcr_pwdet_sar_clk_conf_reg_t pwdet_sar_clk_conf;
    volatile pcr_sdio_slave_conf_reg_t sdio_slave_conf;
    volatile pcr_usb_otg_conf_reg_t usb_otg_conf;
    volatile pcr_usb_otg_clk_conf_reg_t usb_otg_clk_conf;
    volatile pcr_bs_conf_reg_t bs_conf;
    volatile pcr_bs_func_conf_reg_t bs_func_conf;
    volatile pcr_timergroup_wdt_conf_reg_t timergroup_wdt_conf;
    volatile pcr_timergroup_xtal_conf_reg_t timergroup_xtal_conf;
    volatile pcr_km_conf_reg_t km_conf;
    uint32_t reserved_174[930];
    volatile pcr_date_reg_t date;
} pcr_dev_t;

extern pcr_dev_t PCR;

#ifndef __cplusplus
_Static_assert(sizeof(pcr_dev_t) == 0x1000, "Invalid size of pcr_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
